app/controllers/api/v1/managers_controller.rb

SELECT "managers".* FROM "managers"
---
    	def index
        @managers = Manager.all