app/controllers/api/v1/news_posts_controller.rb

SELECT "news_posts".* FROM "news_posts" WHERE "news_posts"."id" = $1 LIMIT 1  [["id", "1"]]
---
    	def show
        @news_post = NewsPost.find(params[:id])