app/controllers/api/v1/shows_controller.rb

SELECT "shows".* FROM "shows" WHERE "shows"."archived" = 'f' ORDER BY title desc
---
    	def index
        @shows = Show.find(:all, :conditions => {:archived => false}, :order => 'title desc')

SELECT "shows".* FROM "shows" WHERE "shows"."id" = 82 LIMIT 1
SELECT "slots".* FROM "slots" WHERE (quarter = 'SU2013' AND start_time <= '2013-08-24 14:50:37.552186' AND end_time >= '2013-08-24 14:50:37.552192' AND saturday = 't')
---
      def onair
        if (Settings.override == true)
          @show = Show.find(Settings.override_show)
        else
          current_day = Time.now.strftime("%A").downcase!
          @slot = Slot.find(:all, :conditions => ["quarter = ? AND start_time <= ? AND end_time >=  ? AND " + current_day + " = 't'", Settings.active_schedule, Time.now, Time.now]).first

SELECT "shows".* FROM "shows" WHERE "shows"."id" = $1 LIMIT 1  [["id", "40"]]
---
    	def show
        @show = Show.find(params[:id])