app/controllers/api/v1/slots_controller.rb

SELECT "slots".* FROM "slots" WHERE (quarter = 'SU2013') ORDER BY start_time
---
	  def index
	    @slots = Slot.find(:all, :order => 'start_time', :conditions => ["quarter = ?", Settings.active_schedule])